package day02;
// 제어문
// 제어문이란 특정 코드 혹은 코드 블락이 실행될지
// 혹은 반복될지를 결정하는 코드이다.

// 제어문에는 조건문과 반복문이 있는데
// 만약 조건식이 true가 나오면 
// 조건문은 코드를 실행시키고
// 반복문은 코드를 반복시킨다.

// 조건문에는 크게 if와 switch가 있고 
// 각각은 사용방법이 다르다.

// if의 경우 조건식이 true가 나오면 실행
// switch의 경우 변수를 하나 선택하여 그 변수의 값에 따른 코드 실행

// 조건식이란, true/false가 결과값으로 나오는 연산자 혹은 method를
// 조건식이라고 한다.

// if(조건식){
//    조건식이 참일때 실행할 코드
// }
public class Ex06If01 {
	public static void main(String[] args) {
		int number = -5;
		// 코드 블락
		// 코드 블락이란 한개의 { }의 사이를 코드 블락이라고 한다.
		// 코드 블락이 중요한 이유는
		// 1. 제어문에선 해당 코드의 실행/반복 여부를 결정
		// 2. 변수의 유효점위를 결정
		
		// 변수의 유효범위(=scope)
		// 변수의 유효범위란 해당 변수가 어디서부터 어디까지
		// 공간을 호출가능한지를 뜻한다.
		// 변수의 유효범위를 벗어나는 순간 해당 변수는 없는 것으로 취급된다.
		// 또한 해당 변수의 유효범위 안에서는 똑같은 이름의 변수는 만들어 줄 수 없다.
		// 변수의 유효범위는 해당 변수가 선언된 다음부터
		// 그 변수의 선언식이 적힌 코드 블락이 종료될때까지이다.
		
		
		if(number > 0) {
			System.out.println("number의 현재값: "+number);
			System.out.println("양의 정수입니다.");
			String name = "조재영";
			System.out.println("name의 현재값: "+name);
		}
		//이미 name의 유효범위가 끝났기 때문에 아래 코드는 에러가 난다.
		//System.out.println("name의 현재값: "+name);
		
		System.out.println("프로그램의 가장 마지막 줄");
	}
}


















