package day01;
// 주석(Comment)
// 주석이란, 코드 파일에 적혀있긴 하지만
// 실제 컴파일 단계에선 무시가 되는 줄을 주석이라고 한다.
// 주석에는 주로 해당 코드가 어떤 역할을 하는지 설명을 적을 때 주로 쓰인다.
// 주석은 한줄 주석과 여러줄 주석이 있는데
// 한줄 주석은 // 다음에 나오는 그 줄은 주석이 된다.
// 여러줄 주석은 /* 로 시작해서
// */ 로 끝나는 가운데 모든 줄은 주석이 된다.
public class Ex01Naming {
	/*
	 *  자바의 이름짓는 규칙
	 *  공통규칙 1. 자바의 이름들은 상수를 제외하곤 모두다 낙타등 표기법을 따라간다.
	 *            낙타등 표기법이란, 여러 단어로 이루어진 이름인 경우
	 *            두번째 단어부터는 매 단어의 첫글자를 대문자로 적어주는 방법이다.
	 *            예시: myNumber, MemberController, selectAll()
	 *  공통규칙 2. 똑같은 종류일 경우 똑같은 이름은 사용할 수 없다.
	 *            만약 myNumber가 존재하고 유효할 경우 myNumber는 또 만들 수 없다.
	 *  공통규칙 3. 자바에서는 자바가 프로그램 내부적으로 사용하는 예약어가 50여가지가 있다.
	 *            해당하는 예약어로는 우리가 이름을 만들어줄 수 없다.
	 *            따라서 그 50가지를 여러분들이 외우셔야 됩니다!! -> 이클립스 없던 시절...
	 *            이클립스에서는 해당 예약어를 자주색으로 표시해준다.
	 *            만약 여러분들이 어떤 이름을 적었는데 자주색으로 나오면?
	 *            예약어이므로 변형을 가해주면 된다!!!!
	 *  클래스 이름 짓기 규칙
	 *  클래스는 대문자로 시작하는 명사이다.
	 *  예: MemberController, Ex01, Scanner
	 *  
	 *  메소드 이름 짓기 규칙
	 *  메소드는 소문자로 시작하는 동사이다.
	 *  메소드는 이름 뒤에 반드시 ()가 붙는다.
	 *  예: print(), select(), selectAll()
	 *  
	 *  변수 이름 짓기 규칙
	 *  변수는 소문자로 시작하는 명사이다.
	 *  예: myNumber, number, scanner
	 *  
	 *  상수 이름 짓기 규칙
	 *  상수는 모든 글자를 전부다 대문자로 적어주고
	 *  단어 사이에 _를 넣어준다.
	 *  이렇게 모든 단어를 대문자로 적고 단어 사이에 _를 넣어주는 표기법을
	 *  뱀 표기법이라고 한다.
	 */
}




